# Number of classes (should match the 'nc' in data.yaml)
nc: 1

# Depth and width multipliers for the model architecture (can be tuned)
depth_multiple: 0.33
width_multiple: 0.50

# Anchor boxes configuration (YOLO-specific setting)
anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

# Backbone network configuration (example structure, adjust as needed)
backbone:
  [[-1, 1, Focus, [64, 3]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 6, BottleneckCSP, [1024]],
  ]

# Head network configuration (example structure, adjust as needed)
head:
  [[-1, 3, BottleneckCSP, [512, False]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [256, False]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [128, False]],
   [[-1, 2, 10, 14], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [256, False]],
   [[-1, 12], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [512, False]],
   [[-1, 8], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [1024, False]],
   [[-1, 5], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [512, False]],
   [[-1, 11], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [256, False]],
   [[-1, 17], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [128, False]],
   [[-1, 20], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [64, False]],
   [[-1, 23], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [32, False]],
   [[-1, 26], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [16, False]],
   [[-1, 29], 1, Concat, [1]],
   [-1, 1, Conv, [16, 1, 1]],  # Output layer, adjust number of filters based on the classes
   [[-1, 30], 1, Detect, [nc, anchors]],  # Detect layer
  ]
